tutorials/.oldIBMcases/hollowBlockFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../parameter"

L_z_neg                 #eval "-$L_z";

n_x                     #eval "ceil(($L_x_max - $L_x_min)/$delta_x)";
n_y                     #eval "ceil(($L_y_max - $L_y_min)/$delta_x)";
n_z                     $n_y;

vertices
(
    ( $L_x_min     $L_y_min   $L_z_neg)
    ( $L_x_max     $L_y_min   $L_z_neg)
    ( $L_x_max     $L_y_max   $L_z_neg)
    ( $L_x_min     $L_y_max   $L_z_neg)
    ( $L_x_min     $L_y_min   $L_z)
    ( $L_x_max     $L_y_min   $L_z)
    ( $L_x_max     $L_y_max   $L_z)
    ( $L_x_min     $L_y_max   $L_z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($n_x $n_y $n_z) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (4 5 6 7)

        );
    }
    back
    {
        type patch;
        faces
        (
            (0 3 2 1)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
