tutorials/.oldIBMcases/hollowBlockFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.ibm
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
        cAlpha          2; //compression coefficient

        advectionScheme isoAdvection;
        reconstructionScheme plicRDF;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    "(U)"
    {
        solver          smoothSolverIBM;
        geometry        box;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
    }

    "(U)Final"
    {
        solver          smoothSolverIBM;
        geometry        box;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }

    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          3;

        advectionScheme         isoAdvection;
        reconstructionScheme    plicRDF;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         3;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    //pRefPoint               (-9 0 0);
    //pRefValue               0;
}


// ************************************************************************* //
